{{- /* Chezmoi-templated Brewfile. Uses DOTFILES_PROFILE env (personal/restricted). */ -}}
# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle`.
#
# See https://github.com/Homebrew/homebrew-bundle

{{- $profile := (env "DOTFILES_PROFILE") -}}
{{- if not $profile }}{{ $profile = "personal" }}{{ end -}}

# BROWSERS #
cask "firefox"
cask "google-chrome"
{{- if eq $profile "personal" }}
cask "brave-browser"
{{- end }}

# COMMUNICATION #
cask "slack"
{{- if eq $profile "personal" }}
cask "discord"
cask "whatsapp"
{{- end }}

# PRODUCTIVITY & ORGANIZATION #
cask "raycast"
cask "visual-studio-code"
{{- if eq $profile "personal" }}
cask "clocker" # Menubar World Clock
cask "notion"
cask "netnewswire"
cask "transmission"
{{- end }}


# FONTS #
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-for-powerline"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-fira-code-nerd-font"

# UTILITIES #
cask "keka"
cask "wireshark"
cask "lunar"
cask "sf-symbols"
{{- if eq $profile "personal" }}
cask "flameshot"
cask "imageoptim"
{{- end }}

# MEDIA #
{{- if eq $profile "personal" }}
cask "iina"
{{- end }}

# DEVELOPMENT #
cask "docker-desktop"
cask "ghostty"
cask "alacritty"

# SYSTEM TOOLS & SECURITY #
cask "1password-cli"
cask "1password"
cask "little-snitch"

# GAMING & EMULATION #
{{- if eq $profile "personal" }}
cask "whisky"
{{- end }}


# TRIAL / TO EVALUATE #
{{- if eq $profile "personal" }}
cask "sensei"
{{- end }}
# cask "monodraw" - To evaluate
# cask "bartender" - To evaluate

# BREW #
# SHELL & TERMINAL TOOLS #
brew "antidote"
brew "atuin"
brew "bash-completion"
brew "starship"
brew "zsh"
brew "zoxide"
brew "fzf"
brew "lsd"
brew "btop"
brew "yazi"
brew "zellij"
brew "bat"
brew "tealdeer"
brew "dlvhdr/formulae/diffnav"

# DEVELOPMENT TOOLS #
brew "chezmoi"
brew "gh"
brew "golangci-lint"
brew "lazygit"
brew "lazydocker"
brew "mise"
brew "nvim"
brew "ollama"
brew "bats-core"
brew "lua"

# SYSTEM UTILITIES #
brew "fastfetch"
brew "fd"
brew "ripgrep"
brew "jq"
brew "unar"
brew "switchaudio-osx"
brew "nowplaying-cli"
brew "aspell"

# NETWORKING & CLOUD #
brew "kubecolor"
brew "kubectx"
brew "minikube"
brew "k9s"

# PROGRAMMING LANGUAGES & RUNTIMES #
brew "python"
brew "pipx"

# MEDIA & DOCUMENTS #
brew "ffmpegthumbnailer"
brew "poppler"

# Review Externally Installed Apps
# =============================================================================

# CREATIVE & DESIGN #
# Adobe Lightroom CC
# Adobe Photoshop CC
# Affinity Photo 2: Image Editor (MAS)
# Affinity Designer 2 (MAS)
# Magnet
# Monodraw (see trial section above)

# PRODUCTIVITY & ORGANIZATION #
# Beeper Desktop
# Goodnotes
# Google Drive
# Notion Calendar
# Notion Web Clipper (Safari)
# Things
# Typefully
# Deliveries: a package tracker (MAS)
# Amphetamine (MAS)

# COMMUNICATION #
# Microsoft Outlook
# Grammarly Desktop
# Grammarly for Safari
# Termius

# UTILITIES #
# CrossOver
# CrossOver Preview
# Cursor
# Elgato Camera Hub
# hammerspoon
# Insta360 Link Controller
# JSONPeep (safari)
# Little Snitch
# Snagit 2024
# SoundSource
# ScreenFlow
# TNAS PC
# WiFiman
# Bartender (see trial section above)

# MEDIA #
# OBS
# Spotify
# Kindle

# NETWORKING & SECURITY #
# ProtonVPN

# VIRTUALIZATION #
# VMware Fusion

# GAMING & REMOTE #
# PS Remote Play

# MAS #
# mas "Affinity Photo 2: Image Editor", id: 1616822987
# mas "Affinity Designer 2", id: 1616831348
# mas "Amphetamine", id: 937984704
# mas "Deliveries: a package tracker", id: 290986013
