# -*-mode:ruby-*- vim:ft=ruby

# ~/.Brewfile
# =============================================================================
# Project dependencies installed using `brew bundle` or `~/dotfiles.sh`.
#
# See https://github.com/Homebrew/homebrew-bundle

# Taps #
tap "homebrew/bundle"

# CASKS #
cask "1password-cli"
cask "1password"
cask "alacritty"
cask "blackhole-2ch"
cask "clocker"
cask "discord"
cask "firefox"
cask "flameshot"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-for-powerline"
cask "google-chrome"
cask "hammerspoon"
cask "homebrew/cask/docker"
cask "iina"
cask "imageoptim"
cask "keka"
cask "little-snitch"
cask "netnewswire"
cask "notion"
cask "raycast"
cask "sensei"
cask "slack"
cask "spotify"
cask "telegram"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
cask "zoom"
# cask "monodraw" - To evaluate
# cask "bartender" - To evaluate

# MAS #
# mas "Affinity Photo 2: Image Editor", id: 1616822987
# mas "Affinity Designer 2", id: 1616831348
# mas "Amphetamine", id: 937984704
# mas "Deliveries: a package tracker", id: 290986013

# BREW #
brew "antidote"
brew "aspell"
brew "atuin"
brew "bash-completion"
brew "bat"
brew "bats-core"
brew "btop"
brew "chezmoi"
brew "fd"
brew "ffmpegthumbnailer"
brew "fzf"
brew "gh"
brew "golangci-lint"
brew "jq"
brew "kubecolor"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "minikube"
brew "mise"
brew "nvim"
brew "poppler"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "unar"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "zsh"
